app/controllers/squads_controller.rb

SELECT "squads".* FROM "squads"
---
  def index
    @squads = Squad.all

INSERT INTO "squads" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "post"], ["created_at", "2020-05-21 00:45:08.223688"], ["updated_at", "2020-05-21 00:45:08.223688"]]
---
  def create
    @squad = Squad.new(squad_params)

    if @squad.save

DELETE FROM "squads" WHERE "squads"."id" = $1  [["id", 8]]
---
  def destroy
    @squad.destroy

SELECT "squads".* FROM "squads" WHERE "squads"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
    def set_squad
      @squad = Squad.find(params[:id])